app/controllers/articles_controller.rb

def update
  @article = Article.find(params[:id])
  if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "7777777777777777"], ["updated_at", "2019-01-15 12:56:47.375577"], ["id", 9]]